[
    {
        "key": "Утечка информации",
        "value": "Неконтролируемое распространение информации за пределы организации"
    },
    {
        "key": "Нарушение доступа к данным",
        "value": "Процесс, при котором информация становится доступной неавторизованным лицам за пределами организации"
    },
    {
        "key": "Чувствительные данные",
        "value": "Информация, которая в перспективе может навредить владельцу. Чаще всего это могут быть финансовые данные, стратегическая информация, коммерческие тайны, интеллектуальная собственность, данные о будущих проектах, а также личные данные клиентов и сотрудников."
    },
    {
        "key": "Веб-боты",
        "value": "Автоматизированные программы, которые выполняют заранее определенные автоматические и повторяющиеся задачи, имитирующие обычное поведение пользователя."
    },
    {
        "key": "Файл robots.txt",
        "value": "Это текстовый файл, который находится на веб-сервере и определяет правила для ботов, посещающих сайт. Эти правила определяют, какие страницы роботы могут просматривать, а какие нет, какие ссылки они должны и не должны переходить, а также другие требования к поведению роботов."
    },
    {
        "key": "Хорошие боты",
        "value": "Автоматизированные скрипты, которые работают в рамках правовых и этических норм, не нарушая конфиденциальность."
    },
    {
        "key": "Плохие боты",
        "value": "Cкрипты, которые были запрограммированы на выполнение вредоносных действий, оказывающих пагубное влияние на веб-сайты и онлайн-ресурсы."
    },
    {
        "key": "Белый список",
        "value": "Cписок адресов посетителей, которым разрешен доступ к ресурсам сайта."
    },
    {
        "key": "Черный список",
        "value": "Cписок адресов посетителей, которым запрещен доступ к ресурсам сайта."
    },
    {
        "key": "Алгоритмы классификации",
        "value": "Классификация - это процесс распределения данных по определенным категориям на основе определенных признаков. Модели классификации помогают нам предсказать принадлежность данных к определенной категории."
    },
    {
        "key": "Алгоритмы кластеризации",
        "value": "Кластеризация - это процесс объединения данных в группы или кластеры на основе их сходства."
    },
    {
        "key": "Логистическая регрессия",
        "value": "Механизм определения вероятности принадлежности данных к одной из двух категорий."
    },
    {
        "key": "KNN (k-nearest neighbors)",
        "value": "Механизм, позволяющий классифицировать точку данных на основе ее ближайшего класса в обучающем наборе данных."
    },
    {
        "key": "SVM (Support vector machine)",
        "value": "Метод для определения разделительной линии (или поверхности), которая максимизирует расстояние между различными классами данных, хорошо работает для бинарной классификации."
    },
    {
        "key": "Байесовская классификация",
        "value": "Метод классификации, основаный на теории Байеса, широко используется в обработке текстов и классификации электронной почты, например, гауссовская модель Naive Bayes."
    },
    {
        "key": "Дерево решений",
        "value": "Метод, основанный на дереве решений, который классифицирует данные в соответствии с их характеристиками и легко интерпретируется."
    },
    {
        "key": "Случайный лес",
        "value": "Метод классификации, который комбинирует несколько деревьев решений для повышения точности и уменьшения погрешности."
    },
    {
        "key": "F1-коэффициент",
        "value": "Показатель, который определяет среднее гармоническое значение точности и отзыва, представляющее собой единый показатель, который уравновешивает их. Он особенно полезен для оценки моделей на несбалансированных данных, поскольку учитывает как ложноположительные, так и ложноотрицательные результаты."
    },
    {
        "key": "ROC-кривая",
        "value": "Это графическое представление эффективности модели при всех порогах классификации, на котором отображается соотношение числа истинно положительных и ложноположительных результатов. AUC, или площадь под кривой, представляет собой площадь под ROC-кривой и является одним из показателей общей эффективности, при этом более высокие значения указывают на лучшую модель."
    }
]
